In [1]:
import pandas as pd

C:\Users\Zahid Mehmood\AppData\Local\Temp\ipykernel_9852\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
test_table = {'id':[13,546,76,8,567,653],'name':['Talal','Bilal','Ehsan','Zahid','Shaheer','Mazz'],'marks':[90,20,40,68,45,30]}

In [3]:
test_table

{'id': [13, 546, 76, 8, 567, 653],
 'name': ['Talal', 'Bilal', 'Ehsan', 'Zahid', 'Shaheer', 'Mazz'],
 'marks': [90, 20, 40, 68, 45, 30]}

In [4]:
df = pd.DataFrame(test_table)

In [5]:
df

    id     name  marks
0   13    Talal     90
1  546    Bilal     20
2   76    Ehsan     40
3    8    Zahid     68
4  567  Shaheer     45
5  653     Mazz     30

In [6]:
df.head(2)

    id   name  marks
0   13  Talal     90
1  546  Bilal     20

In [7]:
df.tail(3)

    id     name  marks
3    8    Zahid     68
4  567  Shaheer     45
5  653     Mazz     30

In [8]:
table = {'id':[23,45,67,14,90,56],'first_name':['Talal','Bilal','Ehsan','Shaheer','Mazz'],'marks':[(92,67,45,23,6,90]}

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (424070385.py, line 1)

In [13]:
table = {'id':[23,45,67,14,90,56],'first_name':['Talal','Bilal','Ehsan',''Zahid','Shaheer','Mazz'],'marks':[92,67,45,23,6,90]}

SyntaxError: unterminated string literal (detected at line 1) (1356732081.py, line 1)

In [10]:
table

{'id': [23, 45, 67, 14, 90, 56],
 'first_name': ['Talal', 'Bilal', 'Ehsan', 'Shaheer', 'Mazz'],
 'marks': [92, 67, 45, 23, 6, 90]}

In [11]:
df

    id     name  marks
0   13    Talal     90
1  546    Bilal     20
2   76    Ehsan     40
3    8    Zahid     68
4  567  Shaheer     45
5  653     Mazz     30

In [15]:
df2 = pd.DataFrame(table)

ValueError: All arrays must be of the same length

In [14]:
df2

NameError: name 'df2' is not defined

In [16]:
table = {'id':[23,45,67,14,90,56],'first_name':['Talal','Bilal','Ehsan','Zahid','Shaheer','Mazz'],'marks':[92,67,45,23,6,90]}

In [17]:
table

{'id': [23, 45, 67, 14, 90, 56],
 'first_name': ['Talal', 'Bilal', 'Ehsan', 'Zahid', 'Shaheer', 'Mazz'],
 'marks': [92, 67, 45, 23, 6, 90]}

In [18]:
df2 = pd.DataFrame(table)

In [19]:
df2

   id first_name  marks
0  23      Talal     92
1  45      Bilal     67
2  67      Ehsan     45
3  14      Zahid     23
4  90    Shaheer      6
5  56       Mazz     90

In [20]:
df.rename(columns={'first_name' : 'name'}, inplace=True)

In [21]:
df2

   id first_name  marks
0  23      Talal     92
1  45      Bilal     67
2  67      Ehsan     45
3  14      Zahid     23
4  90    Shaheer      6
5  56       Mazz     90

In [22]:
df

    id     name  marks
0   13    Talal     90
1  546    Bilal     20
2   76    Ehsan     40
3    8    Zahid     68
4  567  Shaheer     45
5  653     Mazz     30

In [23]:
df2.rename(columns={'first_name' : 'name'}, inplace=True)

In [24]:
df2

   id     name  marks
0  23    Talal     92
1  45    Bilal     67
2  67    Ehsan     45
3  14    Zahid     23
4  90  Shaheer      6
5  56     Mazz     90

In [25]:
pd.merge(df,df2 on = name)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3196610704.py, line 1)

In [26]:
pd.merge(df,df2 on = 'name')

SyntaxError: invalid syntax. Perhaps you forgot a comma? (962288548.py, line 1)

In [27]:
table2 = pd.merge(df,df2 on = 'name')

SyntaxError: invalid syntax. Perhaps you forgot a comma? (4166179673.py, line 1)

In [28]:
table2 = pd.merge(df,df2, on = 'name')

In [29]:
table2

   id_x     name  marks_x  id_y  marks_y
0    13    Talal       90    23       92
1   546    Bilal       20    45       67
2    76    Ehsan       40    67       45
3     8    Zahid       68    14       23
4   567  Shaheer       45    90        6
5   653     Mazz       30    56       90